---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ManyCCWLoops
source: html/dcadb96c-7772-1782-f852-50ed1a9dc02a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ManyCCWLoops Property

Area defined by sketch must be connected.

## Syntax (C#)
```csharp
public static FailureDefinitionId ManyCCWLoops { get; }
```